app/controllers/api/programs_controller.rb

SELECT "programs".* FROM "programs"
---
  def index
    if params[:status] == '-1'
      @programs = Program.all

SELECT  "programs".* FROM "programs" WHERE "programs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @program = Program.find(params[:id])

INSERT INTO "programs" ("name", "creator", "description", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "test"], ["creator", "Tim"], ["description", "It's cool!"], ["author_id", 49], ["created_at", 2017-05-05 04:14:50 UTC], ["updated_at", 2017-05-05 04:14:50 UTC]]
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @program = Program.new(program_params)
    @program.author_id = current_user.id
    if @program.valid?
      @program.save

SELECT  "programs".* FROM "programs" WHERE "programs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "programs" SET "image_url" = $1, "updated_at" = $2 WHERE "programs"."id" = $3  [["image_url", "http://res.cloudinary.com/dfmknrbfz/image/upload/v1478378687/helqkqgwvd1bq6sglnxa.png"], ["updated_at", 2016-11-05 20:44:50 UTC], ["id", 1]]
---
  def update
    @program = Program.find(params[:program][:id])
    if @program.nil?
      render json: ['That program does not exist'], status: 404
    elsif @program.update(program_params)

SELECT  "programs".* FROM "programs" WHERE "programs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "programs" WHERE "programs"."id" = $1  [["id", 7]]
---
  def destroy
    @program = Program.find(params[:id])
    if @program
      @program.destroy

SELECT "programs".* FROM "programs" WHERE (        LOWER(name) LIKE '%rails%' OR
---
  def search
    if params[:query].present?
      @programs = Program.where("name ~ ?", params[:query])