app/controllers/api/programs_controller.rb

SELECT "programs".* FROM "programs" WHERE "programs"."author_id" = $1  [["author_id", 1]]
---
  def index
    if params[:status] == '-1'
      @programs = Program.all
        .reverse_order
        .offset(params[:page].to_i * 10)
        .limit(10)
      @count = Program.all.count
    elsif params[:current_user] && current_user
      @programs = current_user.authored_programs
      @count = @programs.group(:id).length