app/controllers/api/reviews_controller.rb

  def index
    program = Program.find(params[:program_id])
---
SELECT  "programs".* FROM "programs" WHERE "programs"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]

  def create
    @review = Review.new(review_params)
    @review.author_id = current_user.id
    if @review.valid?
      @review.save
---
INSERT INTO "reviews" ("body", "project_used_in", "author_id", "program_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "hi there"], ["project_used_in", "Stuff"], ["author_id", 68], ["program_id", 26], ["created_at", 2017-05-05 04:47:05 UTC], ["updated_at", 2017-05-05 04:47:05 UTC]]