app/controllers/api/statuses_controller.rb

INSERT INTO "statuses" ("content", "user_id", "program_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "2"], ["user_id", 106], ["program_id", 58], ["created_at", 2017-05-05 05:12:58 UTC], ["updated_at", 2017-05-05 05:12:58 UTC]]
---
  def create
    @status = Status.new(status_params)
    @status.user_id = current_user.id
    if @status.valid?
      @status.save

SELECT  "statuses".* FROM "statuses" WHERE "statuses"."user_id" = $1 AND "statuses"."program_id" = $2 LIMIT $3  [["user_id", 132], ["program_id", 16], ["LIMIT", 1]]
---
  def destroy
    if current_user
      current_user.statuses.find_by_program_id(params[:id]).destroy