app/views/api/programs/_program.json.jbuilder

SELECT  "statuses".* FROM "statuses" WHERE "statuses"."program_id" = $1 AND "statuses"."user_id" = $2 LIMIT $3  [["program_id", 14], ["user_id", 55], ["LIMIT", 1]]
---
json.extract! program, :id, :name, :creator, :description, :image_url, :source_code_url, :author_id, :thumbnail_url
status = current_user ? program.statuses.find_by_user_id(current_user.id) : nil